---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.GetScheduleHeightsOnSheet
zh: 明细表
source: html/6e9d5114-0578-8ccd-9550-2264c6ae6737.htm
---
# Autodesk.Revit.DB.ViewSchedule.GetScheduleHeightsOnSheet Method

**中文**: 明细表

Gets the heights of schedule title, column header and each schedule body row.

## Syntax (C#)
```csharp
public ScheduleHeightsOnSheet GetScheduleHeightsOnSheet()
```

## Returns
The ScheduleHeightsOnSheet which contains heights information of a schedule on sheet.

## Remarks
The height is Revit's internal units value.